app/controllers/items_controller.rb

  def show
    @user = current_user.email
    csv_data = CSV.read('app/others/csv/Flat.File.Listingloader.jp.csv', headers: true)
    gon.csv_head = csv_data
    account = Fvalue.find_by(user: current_user.email)
---
SELECT  "fvalues".* FROM "fvalues" WHERE "fvalues"."user" = ? LIMIT ?  [["user", "murakami@ec-merchant.com"], ["LIMIT", 1]]